quest_system_184639194_name=^?^Peace Pact
quest_system_184639194_stage_0=^?^Find the leader of the barbarians.
quest_system_184639194_stage_1=^?^Negotiate with Hogard the Destroyer.
quest_system_184639194_stage_2=^?^Report the results of the negotiations.
quest_system_184639194_task=^?^The barbarians are attacking Darion ships. King Mark's Vicegerent in Verlon Forest, Marquis Kontu, asks that you find the leader of the barbarians and negotiate a peace treaty with him.<br>[reward]
